BAS BMEKZU Project/src/Catalogs/ИНАГРО_ПоказателиСхемМотивации/ИНАГРО_ПоказателиСхемМотивации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИНАГРО_ПоказателиСхемМотивации</name>
  <predefined>
    <items>
      <name>ВечерниеВЧасах</name>
      <description>Вечерние в часах</description>
    </items>
    <items>
      <name>Время</name>
      <description>Время</description>
    </items>
    <items>
      <name>ВремяВДнях</name>
      <description>Время в днях</description>
    </items>
    <items>
      <name>ВремяВКалендарныхДнях</name>
      <description>Время в календарных днях</description>
    </items>
    <items>
      <name>ВремяВЧасах</name>
      <description>Время в часах</description>
    </items>
    <items>
      <name>МинимальнаяЗарплата</name>
      <description>Минимальная зарплата</description>
    </items>
    <items>
      <name>МинимальнаяЗарплатаЧасовая</name>
      <description>Минимальная зарплата часовая</description>
    </items>
    <items>
      <name>НормаВремениВДнях</name>
      <description>Норма времени в днях</description>
    </items>
    <items>
      <name>НормаВремениЗаМесяцВДнях</name>
      <description>Норма времени в днях за месяц</description>
    </items>
    <items>
      <name>НормаВремениВЧасах</name>
      <description>Норма времени в часах</description>
    </items>
    <items>
      <name>НормаВремениЗаМесяцВЧасах</name>
      <description>Норма времени в часах за месяц</description>
    </items>
    <items>
      <name>НочныеВЧасах</name>
      <description>Ночные в часах</description>
    </items>
    <items>
      <name>ОкладТарифНазначения</name>
      <description>Оклад тариф назначения</description>
    </items>
    <items>
      <name>ОкладТариф</name>
      <description>Оклад/Тариф</description>
    </items>
    <items>
      <name>Процент</name>
      <description>Процент</description>
    </items>
    <items>
      <name>ПроцентОплатыБольничного</name>
      <description>Процент оплаты больничного</description>
    </items>
    <items>
      <name>РасчетнаяБаза</name>
      <description>Расчетная база</description>
    </items>
    <items>
      <name>РасчетнаяБазаВремяВДнях</name>
      <description>Расчетная база время в днях</description>
    </items>
    <items>
      <name>РасчетнаяБазаВремяВЧасах</name>
      <description>Расчетная база время в часах</description>
    </items>
    <items>
      <name>СдельнаяВыработка</name>
      <description>Сдельная выработка</description>
    </items>
    <items>
      <name>Сумма</name>
      <description>Сумма</description>
    </items>
    <items>
      <name>СуммаСредней</name>
      <description>Сумма средней</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьИзменения</name>
    <type>
      <types>EnumRef.ИНАГРО_ИзменениеПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ИНАГРО_ТипыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/ИНАГРО_ПоказателиСхемМотивации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// При копировании очищаем свойства, которые не могут быть продублированы.
			Объект.Идентификатор = СформироватьИдентификаторПоказателя(Объект.Идентификатор, Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Предопределенный Тогда
		УстановитьДоступностьПолейСлужебногоПоказателя();
	Иначе
		УстановитьРеквизитыПолейИспользованияЗначений(ЭтаФорма);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
		
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БылоНаименование = Объект.Наименование;
	БылИдентификатор = Объект.Идентификатор;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЕстьРазделители = Ложь;
	Для Позиция = 1 По СтрДлина(Объект.Идентификатор) Цикл
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Объект.Идентификатор, Позиция)) Тогда
			ЕстьРазделители = Истина;
			Объект.Идентификатор = СтрЗаменить(Объект.Идентификатор, Сред(Объект.Идентификатор, Позиция, 1), "?");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ПрежнийИдентификатор = ИдентификаторПоПредставлению(БылоНаименование);
	
	Если Не ЗначениеЗаполнено(Объект.Идентификатор) 
		Или ПрежнийИдентификатор = Объект.Идентификатор Тогда
		Объект.Идентификатор = ИдентификаторПоПредставлению(Объект.Наименование);
		БылИдентификатор = Объект.Идентификатор;
	КонецЕсли;
	
	БылоНаименование = Объект.Наименование;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СформироватьИдентификаторПоказателя(Идентификатор, Ссылка)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("КоличествоСимволов", СтрДлина(Идентификатор));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПоказателиРасчетаЗарплаты.Идентификатор
	               |ИЗ
	               |	Справочник.ИНАГРО_ПоказателиСхемМотивации КАК ПоказателиРасчетаЗарплаты
	               |ГДЕ
	               |	ПОДСТРОКА(ПоказателиРасчетаЗарплаты.Идентификатор, 1, &КоличествоСимволов) = &Идентификатор
	               |	И ПоказателиРасчетаЗарплаты.Ссылка <> &Ссылка";
				   
	ТекущиеИдентификаторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Идентификатор");			   
	
	Сч = 1;
	Пока Истина Цикл 
		НовыйИдентификатор = Идентификатор + Сч;
		Если ТекущиеИдентификаторы.Найти(НовыйИдентификатор) = Неопределено Тогда 
			Возврат НовыйИдентификатор;
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьПолейСлужебногоПоказателя()
	
	// Если показатель служебный, 
	// то редактировать можно только отдельные поля.
	ДоступныеПоля = Новый Массив;
	ДоступныеПоля.Добавить(Элементы.Наименование);
	
	Для Каждого Элемент Из Элементы Цикл
		Если ДоступныеПоля.Найти(Элемент) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") 
			И Элемент.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			Элемент.Доступность = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПоПредставлению(Знач Представление)
	
	Идентификатор = "";
	БылРазделитель = Ложь;
	Для НомСимвола = 1 По СтрДлина(Представление) Цикл
		Символ = Сред(Представление, НомСимвола, 1);
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Символ) 
			И ПустаяСтрока(Идентификатор) Тогда
			// цифры в начале пропускаем
			Продолжить;
		КонецЕсли;
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола(Символ)) Тогда
			БылРазделитель = Истина;
		Иначе
			Если БылРазделитель Тогда
				БылРазделитель = Ложь;
				Символ = ВРег(Символ);
			КонецЕсли;
			Идентификатор = Идентификатор + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Идентификатор;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРеквизитыПолейИспользованияЗначений(Форма)
	
	ДоступностьЭлементов = Не Форма.Объект.Предопределенный;
	
	Форма.Элементы.ВидПоказателя.Доступность = ДоступностьЭлементов;
	Форма.Элементы.ВозможностьИзменения.Доступность =  ДоступностьЭлементов;
	Форма.Элементы.ТипПоказателя.Доступность = ДоступностьЭлементов;
	Форма.Элементы.Идентификатор.Доступность = ДоступностьЭлементов;
	
	Форма.Элементы.ТипПоказателя.АвтоОтметкаНезаполненного	= ДоступностьЭлементов;
	Форма.Элементы.ТипПоказателя.ОтметкаНезаполненного		= ДоступностьЭлементов;
	
КонецПроцедуры

#КонецОбласти
